<template>
    <div>
        正则
    </div>
</template>

<script>
// https://www.cnblogs.com/angelatian/p/6807184.html


/*
  1、验证手机号的正则
    re = /^1[3-9][0-9]{9}$/
    re.test('12099889898')

    re = /^1[3-9]\d{9}$/
    re.test('12099889898')

  2、验证邮箱的正则
    re = /^\w+@[a-z0-9]+(\.[a-z]+){1,3}$/
    re.test('tian@sina.com')

  3、匹配数字
    ^[1-9]\d*$　 　 //匹配正整数
    ^-[1-9]\d*$ 　 //匹配负整数
    ^-?[1-9]\d*$　　 //匹配整数
    ^[1-9]\d*|0$　 //匹配非负整数（正整数 + 0）
    ^-[1-9]\d*|0$　　 //匹配非正整数（负整数 + 0）
    ^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$　　 //匹配正浮点数
    ^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$　 //匹配负浮点数
    ^-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)$　 //匹配浮点数
    ^[1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0$　　 //匹配非负浮点数（正浮点数 + 0）
    ^(-([1-9]\d*\.\d*|0\.\d*[1-9]\d*))|0?\.0+|0$　　//匹配非正浮点数（负浮点数 + 0）

*/

    export default {
        
    }
</script>

<style lang="less" scoped>

</style>