<template>
    <div>
        <p>1、讲述一下计算机网络的七层：</p>
        <p>2、TCP和UDP的区别是什么：</p>
        <p>3、TCP和UDP属于计算机网络中的哪一层：</p>
        <p>4、HTTPS是什么：</p>
        <p>5、SSL加密的原理？</p>
        <p>6、介绍几种常见的状态码：</p>
        <p>7、三次握手和四次挥手</p>
        <p>8、跨域问题的解决方案</p>
        <p>9、post和get请求</p>
        <p>10、Localstorage和session、cookie的区别</p>
        <p>11、localStorage怎么设置过期时间？(localStorage怎么设置时间限定让信息能在一定的时间范围内存储和消失？)</p>
        <p>12. 网页从输入网址到渲染完成经历了哪些过程？（必考）</p>
        <p>13、Http1.0和http2的区别</p>
        <p>14、长链接和短链接是什么</p>
        <p>15、浏览器缓存的基本策略，什么时候该缓存什么时候不该缓存，以及对于控制缓存的字段的相关设置是否清楚？</p>
        <p>16、通信的要点和目的：</p>
        <p>17、请求头和响应头都有哪些内容</p>
    </div>
</template>

<script>
/*

  1、讲述一下计算机网络的七层：
    应用层、表示层、会话层、传输层、网络层、数据链路层、物理层

  2、TCP和UDP的区别是什么：
    TCP：面向连接、传输可靠(保证数据正确性,保证数据顺序)、用于传输大量数据(流模式)、速度慢，建立连接需要开销较多(时间，系统资源)
    UDP：面向非连接、传输不可靠、用于传输少量数据(数据包模式)、速度快
    TCP和UDP协议的一些应用例子：
    TCP一般用于文件传输（FTP HTTP 对数据准确性要求高，速度可以相对慢），发送或接收邮件（POP IMAP SMTP 对数据准确性要求高，非紧急应用），远程登录（TELNET SSH 对数据准确性有一定要求，有连接的概念）等等；UDP一般用于即时通信（QQ聊天 对数据准确性和丢包要求比较低，但速度必须快），在线视频（RTSP 速度一定要快，保证视频连续，但是偶尔花了一个图像帧，人们还是能接受的），网络语音电话（VoIP 语音数据包一般比较小，需要高速发送，偶尔断音或串音也没有问题）等等。

  3、TCP和UDP属于计算机网络中的哪一层：
    网际层协议：IP协议、ICMP协议、ARP协议、RARP协议
    传输层协议：TCP协议、UDP协议
    应用层协议：FTP、Telnet、SMTP、HTTP、RIP、NFS、DNS

  4、HTTPS是什么： 
    HTTPS即加密的HTTP，HTTPS并不是一个新协议，而是HTTP+SSL（TLS）。
    原本HTTP先和TCP（假定传输层是TCP协议）直接通信，而加了SSL后，就变成HTTP先和SSL通信，再由SSL和TCP通信，相当于SSL被嵌在了HTTP和TCP之间
  
  5、SSL加密的原理？
    http://www.ruanyifeng.com/blog/2014/09/illustration-ssl.html

  6、介绍几种常见的状态码：
    2XX系列：代表请求已成功被服务器接收、理解、并接受。
      200状态码：表示请求已成功，请求所希望的响应头或数据体将随此响应返回
      201状态码：表示请求成功并且服务器创建了新的资源，且其 URI 已经随Location 头信息返回。
    3XX系列：代表需要客户端采取进一步的操作才能完成请求，这些状态码用来重定向，后续的请求地址（重定向目标）在本次响应的 Location 域中指明。
      301状态码：被请求的资源已永久移动到新位置。服务器返回此响应（对 GET 或 HEAD 请求的响应）时，会自动将请求者转到新位置。
      302状态码：请求的资源临时从不同的URI响应请求，但请求者应继续使用原有位置来进行以后的请求。
      304状态码：自从上次请求后，请求的网页未修改过。服务器返回此响应时，不会返回网页内容。
    4XX系列：表示请求错误。代表了客户端看起来可能发生了错误，妨碍了服务器的处理。
      401状态码：请求要求身份验证。 对于需要登录的网页，服务器可能返回此响应。
      403状态码：服务器已经理解请求，但是拒绝执行它。与401响应不同的是，身份验证并不能提供任何帮助，而且这个请求也不应该被重复提交。
      404状态码：请求失败，请求所希望得到的资源未被在服务器上发现。
    5xx系列：代表了服务器在处理请求的过程中有错误或者异常状态发生，也有可能是服务器意识到以当前的软硬件资源无法完成对请求的处理。
      500状态码：服务器遇到了一个未曾预料的状况，导致了它无法完成对请求的处理。
      503状态码：由于临时的服务器维护或者过载，服务器当前无法处理请求。

  7、三次握手和四次挥手
    https://www.cnblogs.com/Andya/p/7272462.html

  8、跨域问题的解决方案
　　1、 通过jsonp跨域
　　2、 document.domain + iframe跨域
　　3、 location.hash + iframe
　　4、 window.name + iframe跨域
　　5、 postMessage跨域 使用HTML5中新引进的window.postMessage方法来跨域传送数据（ie 67 不支持）
　　6、 跨域资源共享（CORS） 需要服务器设置header ：Access-Control-Allow-Origin。
　　7、 nginx代理跨域 这个方法一般很少有人提及，但是他可以不用目标服务器配合，不过需要你搭建一个中转nginx服务器，用于转发请求
　　8、 nodejs中间件代理跨域
　　9、 WebSocket协议跨域

  9、post和get请求
    参考博客：https://www.cnblogs.com/fundebug/p/10416234.html

  10、Localstorage和session、cookie的区别
    共同点：都是保存在浏览器端，且同源的。
    区别：
    （1）cookie数据始终在同源的http请求中携带（即使不需要），即cookie在浏览器和服务器间来回传递。
        而sessionStorage和localStorage不会自动把数据发给服务器，仅在本地保存。cookie数据还有路径（path）的概念，可以限制cookie只属于某个路径下。
    （2）存储大小限制也不同：
        cookie数据不能超过4k，同时因为每次http请求都会携带cookie，所以cookie只适合保存很小的数据，如会话标识。
        sessionStorage和localStorage 虽然也有存储大小的限制，但比cookie大得多，可以达到5M或更大。
    （3）作用域不同：
        sessionStorage不在不同的浏览器窗口中共享，即使是同一个页面；
        localStorage 在所有同源窗口中都是共享的；
        cookie 也是在所有同源窗口中都是共享的。
    （4）存储的时间不同：
        cookie只在设置的cookie过期时间之前一直有效，即使窗口或浏览器关闭。
        使用HTML5 Web存储的localStorage和sessionStorage方式进行Web页面数据本地存储。
        页面参考如下图，能将页面上的数据进行本地存储。并能读取存储的数据显示在页面上。
        localStorage（本地存储）,可以长期存储数据，没有时间限制，一天，一年，两年甚至更长，数据都可以使用。
        sessionStorage（会话存储），只有在浏览器被关闭之前使用，创建另一个页面时同意可以使用，关闭浏览器之后数据就会消失。)

  11、localStorage怎么设置过期时间？(localStorage怎么设置一个时间限定让信息能在一定的时间范围内存储和消失？)
      localStorage本身没有设置过期时间的属性，但是可以在存储的时候设置一个时间戳，每次取值的时候对比时间

  12. 网页从输入网址到渲染完成经历了哪些过程？（必考）
      输入网址；
      发送到DNS服务器，并获取域名对应的web服务器对应的ip地址；
      与web服务器建立TCP连接；
      浏览器向web服务器发送http请求；
      web服务器响应请求，并返回指定url的数据（或错误信息，或重定向的新的url地址）；
      浏览器下载web服务器返回的数据及解析html源文件；
      生成DOM树，解析css和js，渲染页面，直至显示完成；

      输入地址
      1.浏览器查找域名的 IP 地址
      2.这一步包括 DNS 具体的查找过程，包括：浏览器缓存->系统缓存->路由器缓存…
      3.浏览器向 web 服务器发送一个 HTTP 请求
      4.服务器的永久重定向响应（从 http://example.com 到 http://www.example.com）
      5.浏览器跟踪重定向地址
      6.服务器处理请求
      7.服务器返回一个 HTTP 响应
      8.浏览器显示 HTML
      9.浏览器发送请求获取嵌入在 HTML 中的资源（如图片、音频、视频、CSS、JS等等）
      10.浏览器发送异步请求

  13、Http1.0和http2的区别
      https://www.cnblogs.com/heluan/p/8620312.html

  14、长链接和短链接是什么
      https://www.cnblogs.com/gotodsp/p/6366163.html

  15、浏览器缓存的基本策略，什么时候该缓存什么时候不该缓存，以及对于控制缓存的字段的相关设置是否清楚？
      https://www.jianshu.com/p/54cc04190252
      缓存的设置:
      强缓存和协商缓存
      expires
      cache-control

  16、通信的要点和目的：
      要点：1. 发送者和接收者 2. 传输媒介 3. 传输的数据 4. 传输格式（协议）
      目的：1. 同步数据 2. 传递指令(执行的方法)

  17、请求头和响应头都有哪些内容
      https://www.cnblogs.com/fighter007/p/8445435.html
      
  */
    export default {
        
    }
</script>

<style lang="scss" scoped>

</style>